
&НаСервере
Процедура ЗаписатьсяНаСервере()
	ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
	ЗаписьКлиента.Дата        = НачалоМинуты(Объект.ДатаЗаписи);
	ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
	ПереченьУслуг = "";
	
	Для ЭлементСтрока = 0 По ЭтаФорма.Объект.Услуги.Количество()-1 Цикл
		СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
		
		УслугаИзТЧ = ЭтаФорма.Объект.Услуги[ЭлементСтрока].Услуга;
		ЦенаИзТЧ = УслугаИзТЧ.Стоимость;
		
		СтрокаУслуги.Номенклатура = УслугаИзТЧ;
		СтрокаУслуги.Стоимость    = ЦенаИзТЧ;
		
		Если ЭлементСтрока = ЭтаФорма.Объект.Услуги.Количество()-1 Тогда 	
			ПереченьУслуг = ПереченьУслуг + СтрШаблон(" ""%1""" , Объект.Услуги[ЭлементСтрока].Услуга.Наименование);	
		Иначе
			ПереченьУслуг = ПереченьУслуг + СтрШаблон(" ""%1,""" , Объект.Услуги[ЭлементСтрока].Услуга.Наименование);
		КонецЕсли;	
	КонецЦикла;
	
	//ЗаписьКлиента.Записать();
	
	//Создаем JSON
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	СтруктураРеквизитовДокумента.Вставить("GUIDПользователя", ПараметрыСеанса.ТекущийПользователь.ВнешнийGUID);
	
	МассивУслуг = Новый Массив;
	
	Услуга = Новый Структура;
	Услуга.Вставить("Номенклатура", Строка(Объект.Услуга));
	Услуга.Вставить("Цена", ЭтаФорма.Услуги[0].Стоимость);
	Услуга.Вставить("Количество", 1);
	Услуга.Вставить("Сумма", ЭтаФорма.Услуги[0].Стоимость);
	
	МассивУслуг.Добавить(Услуга);
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);	
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);   
	
	//Отправляем документ Запись в основную базу
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	Если ДокументУспешноОтправлен Тогда        
		ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3", 
		Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));                                    
		СообщениеПользователю.Сообщить();
		
		//Очистим реквизиты формы после успешной отправки документа
		Объект.ДатаЗаписи    = '00010101';
		Объект.Сотрудник    = Справочники.Сотрудники.ПустаяСсылка();
		Объект.Услуга        = Справочники.Услуги.ПустаяСсылка();
		ЭтаФорма.Стоимость  = 0;    
	Иначе    
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст    = "Не удалось отправить Запись!";
		СообщениеПользователю.Сообщить();
	КонецЕсли; 
	
	СообщениеПользователю = Новый СообщениеПользователю;
	Если Объект.Услуги.Количество() = 1 Тогда
		СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3", Объект.Услуги[0].Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));
	Иначе
		СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услуги %1 к мастеру %2 на дату %3", ПереченьУслуг, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
	
КонецПроцедуры 

&НаСервере
Процедура УслугаПриИзмененииНаСервере()
	
	ТекСтрока= Объект.Услуги.НайтиПоИдентификатору(Элементы.Услуги.ТекущаяСтрока); 
	ТекСтрока.Цена = ТекСтрока.Услуга.Стоимость;
	ЭтаФорма.Стоимость = Объект.Услуги.Итог("Цена");
КонецПроцедуры

////////////////////////////
&НаКлиенте
Процедура Записаться(Команда)
	ЗаписатьсяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УслугаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры


