Процедура Разлогиниться() Экспорт
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();    
	КонецЕсли;
КонецПроцедуры    

Процедура ВыполнитьАутентификацию(Логин) Экспорт    
	Соединение    = Новый HTTPСоединение("192.168.0.144",,"MobileClient");//(1)
	Запрос        = Новый HTTPЗапрос("barber/hs/users/getUser?username="+Логин);//(2)
	Ответ        = Соединение.Получить(Запрос);//(3)    
	Если Ответ.КодСостояния = 200 Тогда
		МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		Если МассивДанныхПользователя.Количество() = 0 Тогда //(4)
			Сообщить("По логину " + Логин +" пользователь не найден!");
		ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда //(5)
			АвторизоватьПользователя(МассивданныхПользователя[0],);
		КонецЕсли;
	Иначе
		Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;    
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеПользователя, Телефон) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();
    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользователь.ВнешнийGUID = НовыйПользователь.Код;  
        НовыйПользователь.Наименование = ДанныеПользователя;
		НовыйПользователь.Телефон = Телефон; 
        НовыйПользователь.Записать(); 
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = НовыйПользователь.Ссылка;
	
КонецПроцедуры